const quizArr = [
  {
    id: 1,
    question: "किसी द्विघात समीकरण के विवेचक का मान शून्य से बड़ा होने पर दोनों मूल होंगे-",
    options: {
      A: "वास्तविक और भिन्न",
      B: "वास्तविक और समान",
      C: "अवास्तविक और समान",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 2,
    question: "ax²- + bx + c = 0 के मूल समान होंगे, यदि ",
    options: {
      A: "b² = 4ac",
      B: "ac = 0",
      C: "b² + 4ac = 0",
      D: "b² + ac = O",
    },
    answer: "B",
  },
  {
    id: 3,
    question: "द्विघात समीकरण : x² + x - 1 = 0 के मूलों की प्रकृति होगी",
    options: {
      A: "वास्तविक तथा समान",
      B: "वास्तविक तथा असमान",
      C: "वास्तविक नहीं",
      D: "इनमें कोई नहीं",
    },
    answer: "A",
  },
  {
    id: 4,
    question: "यदि x² - 5x + 4 = 0, तो x का मान होगा",
    options: {
      A: "पूर्णांक",
      B: "भिन्न संख्या",
      C: "अपरिमेय संख्या",
      D: "वास्तविक नहीं",
    },
    answer: "B",
  },
  {
    id: 5,
    question: "2x² + 5x-12 = 0 का एक मूल निम्नलिखित में कौन है ?",
    options: {
      A:  "0",
      B:  "2",
      C:  "5",
      D:  "1",
    },
    answer: "D",
  },
  {
    id: 6,
    question:
      "समीकरण a (b - c) x² + (bc - a)x+c(a-b) = 0 का एक मूल है",
    options: {
      A: " a + b",
      B: "a + b + c + d",
      C: "a + b + c",
      D: "b + c",
    },
    answer: "D",
  },
  {
    id: 7,
    question: "x² - 3x + 2 = 0 का एक मूल है",
    options: {
      A: "1",
      B: "-1",
      C: "2",
      D: "-2",
    },
    answer: "B",
  },
  {
    id: 8,
    question: "द्विघात समीकरण bx² + ax + c = 0 का विविक्तकर होगा ",
    options: {
      A: "b² - 4ac",
      B: "c2-4ab",
      C: "4 + √5",
      D: "a² - 4bc",
    },
    answer: "D",
  },
  {
    id: 9,
    question:
      "द्विघात समीकरण 2x² - 4x + 3 = 0 का विवेचक होगा",
    options: {
      A: "1",
      B: "2",
      C: "-8",
      D: "5",
    },
    answer: "C",
  },
  {
    id: 10,
    question: "द्विघात समीकरण x² + 6x + 5 = 0 का हल है",
    options: {
      A: "-2 -4",
      B: "3 -6",
      C: "-2 -5",
      D: "इनमें से कोई नहीं",
    },
    answer: "C",
  },
  {
    id: 11,
    question: "द्विघात समीकरण 2x² - 7x + 6 = 0 का विविक्तकर बराबर है",
    options: {
      A: "0",
      B: "1",
      C: "2",
      D: "3",
    },
    answer: "B",
  },
  {
    id: 12,
    question: "द्विघात समीकरण x² - 4x + b = 0 का विविक्तकर निम्नलिखित में कौन है ?",
    options: {
      A: "16-4b",
      B: "4b-16",
      C: "b² - 16",
      D: "16-b²",
    },
    answer: "B",
  },
  {
    id: 13,
    question: "-3x² + 4x + 5 = 0 के मूलों का योगफल कितना होगा ?",
    options: {
      A: "3/4",
      B: "4/3",
      C: "4/5",
      D: "5/4",
    },
    answer: "B",
  },
  {
    id: 14,
    question: "यदि समीकरण 2x² + px - 3 = 0 का एक मूल - 3 हो, तो p का मान होगा",
    options: {
      A: "3",
      B: "5",
      C: "√7",
      D: "4",
    },
    answer: "D",
  },
  {
    id: 15,
    question: "यदि समीकरण x² + 2kx + 4 = का एक मूल 2 है, तो k का मान है",
    options: {
      A: "1",
      B: "-1",
      C: "-2",
      D: "इनमें से कोई नहीं",
    },
    answer: "C",
  },
  {
    id: 16,
    question:
      "एक वर्ष पहले, एक आदमी अपने बेटे से 8 गुना बड़ा था। अब उसकी उम्र उसके बेटे की उम्र के वर्ग के बराबर है। उनकी वर्तमान आयु है",
    options: {
      A: "7 वर्ष, 49 वर्ष",
      B: "5 वर्ष, 25 वर्ष",
      C: "1 वर्ष, 50 वर्ष",
      D: "6 वर्ष. 49 वर्ष",
    },
    answer: "B",
  },
  {
    id: 17,
    question: "यदि -5 द्विघात समीकरण 2x2 + px - 15 = 0 का मूल है, तो",
    options: {
      A: "पी = 3",
      B: "पी = 5",
      C: "पी = 7 ",
      D: "पी = 1 ",
    },
    answer: "C",
  },
  {
    id: 18,
    question: "दो लगातार विषम धनात्मक पूर्णांक, जिनके वर्गों का योग 290 है, हैं",
    options: {
      A: "13, 15",
      B: "61, 55",
      C: "11, 13",
      D: "5, 7",
    },
    answer: "C",
  },
  {
    id: 19,
    question:
      "k का मान (ओं) जिसके लिए द्विघात समीकरण 2x2 -kx + k = 0 के मूल समान हैं",
    options: {
      A: "5",
      B: "4",
      C: "6",
      D: "0",
    },
    answer: "B",
  },
  {
    id: 20,
    question:
      "दो लगातार विषम धनात्मक पूर्णांक ज्ञात कीजिए, जिनके वर्ग का योग 290 है",
    options: {
      A: "17, 11",
      B: "11, 9",
      C: "9, 11",
      D: "11, 13",
    },
    answer: "C",
  },
];
