const quizArr = [
  {
    id: 1,
    question: "k के किस मान के लिए समीकरण निकाय 4x + 3y = 5, 2x + ky = 1 का कोई भी हल नहीं होगा ?",
    options: {
      A: "1",
      B: "2",
      C: "3",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 2,
    question: "k के किस मान के लिए समीकरण - निकाय 4x + ky = 6, 2x – 4y = 3 का अनगिनत हल होगा ?",
    options: {
      A: "1",
      B: "2",
      C: "3",
      D: "-8",
    },
    answer: "D",
  },
  {
    id: 3,
    question: "दो चरों x,y में रैखिक समीकरण ax + by + c = 0 के कितने अधिकतम हल संभव हैं ?",
    options: {
      A: "एक",
      B: "दो",
      C: "अनगिनत",
      D: "इनमें कोई नहीं",
    },
    answer: "A",
  },
  {
    id: 4,
    question: "समीकरण - निकाय 5x - 3y + 2 = 0 और 6x + y - 2 = 0 का किस प्रकार का हल संभव है ?",
    options: {
      A: "हल",
      B: "संभव नहीं",
      C: "अनेक हल",
      D: "अद्वितीय हल दो हल",
    },
    answer: "B",
  },
  {
    id: 5,
    question: "यदि x = 1, y = 2 समीकरण - निकाय 3x + ay = 1 और 7x - 2y = 3 का हल हो, तो a का मान क्या होगा ?",
    options: {
      A:  "1",
      B:  "-1",
      C:  "2",
      D:  "-2",
    },
    answer: "B",
  },
  {
    id: 6,
    question:
      "यदि समीकरण 3x - 2y + 1 = 0 का हल x = 1, y = k हो, तो k का मान होगा ?",
    options: {
      A: "4",
      B: "2",
      C: "0",
      D: "1",
    },
    answer: "B",
  },
  {
    id: 7,
    question: "रैखिक समीकरण - युग्म जिसका कोई हल नहीं होता, क्या कहलाता है ?",
    options: {
      A: "संगत युग्म",
      B: "असंगत युग्म",
      C: "आश्रित युग्म",
      D: "इनमें कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 8,
    question: "रैखिक समीकरण - युग्म को हल करने की कितनी बीजीय विधियाँ हैं?",
    options: {
      A: "2",
      B: "3",
      C: "5",
      D: "4",
    },
    answer: "B",
  },
  {
    id: 9,
    question:
      "असंगत समीकरण - युग्म द्वारा निरूपित रेखाएँ कैसी होती हैं ?",
    options: {
      A: "प्रतिच्छेदी",
      B: "समांतर",
      C: "संपाति",
      D: "इनमें कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 10,
    question: "असंगत समीकरणों के हल कितने होते हैं ?",
    options: {
      A: "द्वितीय",
      B: "अनगिनत",
      C: "कोई हल नहीं",
      D: "इनमें से कोई नहीं",
    },
    answer: "A",
  },
  {
    id: 11,
    question: "दो एकघातीय समीकरणों के लेखाचित्र यदि प्रतिच्छेदी रेखाएँ हों, तो इस स्थिति में समीकरण - निकाय के कितने हल होते हैं?",
    options: {
      A: "द्वितीय",
      B: "अनगिनत",
      C: "कोई हल नहीं",
      D: "इनमें से कोई नहीं",
    },
    answer: "D",
  },
  {
    id: 12,
    question: "सरल रेखाओं x - y = 0 और x + y = 0 के प्रतिच्छेद बिंदु के निर्देशांक क्या होंगे ?",
    options: {
      A: "1,1",
      B: "1,2",
      C: "0,0",
      D: "2,2",
    },
    answer: "D",
  },
  {
    id: 13,
    question: "एक रैखिक समीकरण का घात होगा-",
    options: {
      A: "0",
      B: "1",
      C: "2",
      D: "इनमें से कोई नहीं",
    },
    answer: "C",
  },
  {
    id: 14,
    question: "समीकरण युग्म x + 2y + 5 = 0 तथा - 3x - 6y + 1 = 0 के हल है:",
    options: {
      A: "अद्वितीय हल",
      B: "अन्नत हल",
      C: "कोई हल नहीं",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 15,
    question: "दो चर x, y में रैखिक समीकरण ax + by + c = 0 के वास्तविक संख्याओं के समुच्चय में कितने हल होंगे?",
    options: {
      A: "1",
      B: "2",
      C: "3",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 16,
    question:
      "दो चर में दो एकघातीय समीकरणों के ग्राफ यदि प्रतिच्छेदी रेखाएँ, हों, तो हलों की संख्या है:",
    options: {
      A: "सिर्फ एक",
      B: "अनन्त हल",
      C: "कोई हल नहीं",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 17,
    question: "रैखिक समीकरण युग्म x + 3y - 4 = 0 तथा 2x – 5y - 1 = 0 है,",
    options: {
      A: "अविरोधी",
      B: "विरोधी",
      C: "आश्रित",
      D: "उपरोक्त में से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 18,
    question: "यदि दो चर में दो रैखिक समीकरणों के हल अनन्त हों, तो उनके आलेख होंगे:",
    options: {
      A: "दो समानातर रेखाएँ",
      B: "दो प्रतिच्छेदी रेखाएँ",
      C: "दो संपाती रेखाएँ",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 19,
    question:
      "k के किस मान के लिए समीकरण निकाय x + 2y = 3 तथा 5x + ky = 15 के अनन्त हल है:",
    options: {
      A: "10",
      B: "5",
      C: "6",
      D: "1",
    },
    answer: "A",
  },
  {
    id: 20,
    question:
      "एक रैखिक समीकरण का घात होगा:",
    options: {
      A: "1",
      B: "2",
      C: "3",
      D: "4",
    },
    answer: "B",
  },
];
