const quizArr = [
  {
    id: 1,
    question: "AP 6,3,0, -3 .... का सार्वअंतर क्या है ?",
    options: {
      A: "1",
      B: "2",
      C: "-3",
      D: "इनमें से कोई नहीं",
    },
    answer: "C",
  },
  {
    id: 2,
    question: "AP -5, -1,3,7,... के लिए सार्वअंतर क्या है ?",
    options: {
      A: "1",
      B: "2",
      C: "-3",
      D: "अनंत",
    },
    answer: "C",
  },
  {
    id: 3,
    question: "AP 10, 7, 4 -62 के अंतिम पद के ठीक पहले का पद है ?",
    options: {
      A: "56",
      B: "-57",
      C: "-59",
      D: "52",
    },
    answer: "B",
  },
  {
    id: 4,
    question: "निम्नलिखित में कौन AP में है ?",
    options: {
      A: "2,4,8,16,...",
      B: "1,3,9,27, ...",
      C: "-10, -6, -2, 2, ...",
      D: "a, a², a³, a, ...",
    },
    answer: "B",
  },
  {
    id: 5,
    question: "यदि AP का सामान्य पद 3n + 5 है, तो इसका सार्वअंतर होगा",
    options: {
      A:  "5",
      B:  "4",
      C:  "6",
      D:  "2",
    },
    answer: "D",
  },
  {
    id: 6,
    question:
      "यदि किसी स. श्रे. का nवां पद an + b हैं, तो उसका पदांतर है -",
    options: {
      A: "b",
      B: "n",
      C: "a",
      D: "1",
    },
    answer: "B",
  },
  {
    id: 7,
    question: "एक स. श्रे. में । = 28, s = 144, कुल पद 9 हैं, तो a का मान क्या है ?",
    options: {
      A: "3",
      B: "4",
      C: "5",
      D: "6",
    },
    answer: "B",
  },
  {
    id: 8,
    question: "1,4,7, 10, ... के 18 वें पद का मान है -",
    options: {
      A: "50",
      B: "45",
      C: "52",
      D: "35",
    },
    answer: "A",
  },
  {
    id: 9,
    question:
      "यदि AP का प्रथम पद a और पदातर d हों, तो nवाँ पद होगा",
    options: {
      A: "a + nd",
      B: "a+(n-1)d",
      C: "a+(n+1) d",
      D: "(2a+(n-1)",
    },
    answer: "B",
  },
  {
    id: 10,
    question: "-10, -6, -2,2,.... 34 में पदों की संख्या है ?",
    options: {
      A: "11",
      B: "13",
      C: "15",
      D: "इनमें से कोई नहीं",
    },
    answer: "B",
  },
  {
    id: 11,
    question: "1+2+3 + + 100 का योगफल है ?",
    options: {
      A: "8080",
      B: "9090",
      C: "5050",
      D: "7070",
    },
    answer: "C",
  },
  {
    id: 12,
    question: "श्रेढ़ी 21, 18, 15, ... का कौन - सा पद शून्य है ?",
    options: {
      A: "9 वाँ",
      B: "6 वाँ",
      C: "8 वाँ",
      D: "12 वाँ",
    },
    answer: "D",
  },
  {
    id: 13,
    question: "स. श्रे. 4, 9, 14, 19,... का कौन सा पद 109 है ?",
    options: {
      A: "20 वाँ",
      B: "21 वाँ",
      C: "23 वाँ",
      D: "22 वाँ",
    },
    answer: "B",
  },
  {
    id: 14,
    question: "स. श्रे. 10, 7, 4, ... का 30 वाँ पद बराबर है?",
    options: {
      A: "66",
      B: "-55",
      C: "55",
      D: "-66",
    },
    answer: "A",
  },
  {
    id: 15,
    question: "समांतर श्रेढ़ी 2, 7, 12, ... का 10 वाँ पद क्या होगा ?",
    options: {
      A: "-25",
      B: "25",
      C: "52",
      D: "इनमें से कोई नहीं",
    },
    answer: "C",
  },
  {
    id: 16,
    question:
      "1,5,9,13, 17, 21, 25 ..... समान्तर श्रेढ़ी में हैं, तो पदान्तर का मान होगा:",
    options: {
      A: "4",
      B: "3",
      C: "2",
      D: "1",
    },
    answer: "C",
  },
  {
    id: 17,
    question: "निम्नलिखित में कौन समांतर श्रेणी में है?",
    options: {
      A: "2,4,8,16 ...",
      B: "-10,-6,-2, 2....",
      C: "3,5,4,2...",
      D: "√3.16.√9/12 ....",
    },
    answer: "B",
  },
  {
    id: 18,
    question: "0 और 50 के बीच की विषम संख्याओं का योगफल होगाः",
    options: {
      A: "621",
      B: "625",
      C: "652",
      D: "654",
    },
    answer: "B",
  },
  {
    id: 19,
    question:
      "तीन संख्याएँ A.P. में हैं तथा उनका योग 24 है। उनके वर्गों का योग 20 है, तो वे संख्याएँ हैं:",
    options: {
      A: "4,8,12",
      B: "6,8,10",
      C: "5,8,11",
      D: "2,8,14",
    },
    answer: "B",
  },
  {
    id: 20,
    question:
      "Α.Ρ. 10, 7, 4,... का 30 वाँ पद है:",
    options: {
      A: "77",
      B: "-76",
      C: "55",
      D: "-77",
    },
    answer: "D",
  },
];
